; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	thermograph0 - mode
	image2 - mode
	spectrograph3 - mode
	thermograph4 - mode
	infrared5 - mode
	infrared1 - mode
	Star4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star5 - direction
	GroundStation1 - direction
	Star2 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph4)
	(supports instrument0 image2)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared5)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument2 infrared5)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph4)
	(supports instrument3 infrared5)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star5)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star5)
	(supports instrument7 thermograph4)
	(supports instrument7 spectrograph3)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument8 infrared5)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 Star5)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 thermograph0)
	(supports instrument11 infrared5)
	(supports instrument11 image2)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet12)
)
(:goal (and
	(pointing satellite1 Planet9)
	(have_image Planet6 image2)
	(have_image Star7 infrared5)
	(have_image Star7 thermograph4)
	(have_image Planet8 infrared1)
	(have_image Planet8 thermograph0)
	(have_image Planet9 infrared5)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 infrared5)
	(have_image Phenomenon10 spectrograph3)
	(have_image Planet11 spectrograph3)
	(have_image Planet12 spectrograph3)
	(have_image Planet12 thermograph4)
))

)

; plan
1. (turn_to satellite2 groundstation1 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 13
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 13
3. (calibrate satellite2 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 13
4. (turn_to satellite2 star7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star7)
   goals met: 0 of 13
5. (take_image satellite2 star7 instrument7 thermograph4)
   added: (have_image star7 thermograph4)
   goals met: 1 of 13
6. (turn_to satellite2 planet6 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet6)
   goals met: 1 of 13
7. (take_image satellite2 planet6 instrument7 image2)
   added: (have_image planet6 image2)
   goals met: 2 of 13
8. (turn_to satellite2 planet12 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet12)
   goals met: 2 of 13
9. (take_image satellite2 planet12 instrument7 thermograph4)
   added: (have_image planet12 thermograph4)
   goals met: 3 of 13
10. (take_image satellite2 planet12 instrument7 spectrograph3)
   added: (have_image planet12 spectrograph3)
   goals met: 4 of 13
11. (turn_to satellite2 planet11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet11)
   goals met: 4 of 13
12. (take_image satellite2 planet11 instrument7 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 5 of 13
13. (turn_to satellite2 phenomenon10 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon10)
   goals met: 5 of 13
14. (turn_to satellite1 groundstation3 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation3)
   goals met: 5 of 13
15. (take_image satellite2 phenomenon10 instrument7 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 6 of 13
16. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 6 of 13
17. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 6 of 13
18. (turn_to satellite1 phenomenon10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon10)
   goals met: 6 of 13
19. (take_image satellite1 phenomenon10 instrument2 infrared5)
   added: (have_image phenomenon10 infrared5)
   goals met: 7 of 13
20. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 7 of 13
21. (take_image satellite1 planet8 instrument2 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 8 of 13
22. (take_image satellite1 planet8 instrument2 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 9 of 13
23. (turn_to satellite1 star7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star7)
   goals met: 9 of 13
24. (take_image satellite1 star7 instrument2 infrared5)
   added: (have_image star7 infrared5)
   goals met: 10 of 13
25. (turn_to satellite1 planet9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet9)
   goals met: 11 of 13
26. (take_image satellite1 planet9 instrument2 infrared5)
   added: (have_image planet9 infrared5)
   goals met: 12 of 13
27. (take_image satellite1 planet9 instrument2 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 13 of 13
